; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v3 ?v2)
             (pred_10 ?v4 ?v11)
             (pred_7 ?v3 ?v11)
             (pred_5 ?v6 ?v3 )
	     (pred_3 ?v3)
             (pred_9 ?v8)
             (pred_12 ?v4)
             (pred_8 ?v11)
             (pred_4 ?v3)
             (pred_11 ?v4)
             (pred_6 ?v3)
             (pred_2 ))



(:action op_5
:parameters (?v7 ?v1 ?v12 ?v5)
:precondition (and (pred_9 ?v7) (pred_9 ?v1) (pred_12 ?v12) (pred_8 ?v5)
          (pred_1 ?v7 ?v1) (pred_10 ?v12 ?v5)
                   (pred_7 ?v1 ?v5) (pred_3 ?v7) 
                   (pred_4 ?v1) (pred_11 ?v12))
:effect (and  (pred_6 ?v1) (not (pred_4 ?v1))))


(:action op_1
:parameters (?v7 ?v10)
:precondition (and (pred_9 ?v7) (pred_9 ?v10)
               (pred_3 ?v7) (pred_1 ?v7 ?v10) (pred_6 ?v10))
:effect (and (pred_3 ?v10) (not (pred_3 ?v7))))

(:action op_2
:parameters (?v7 ?v12)
:precondition (and (pred_9 ?v7) (pred_12 ?v12) 
                  (pred_3 ?v7) (pred_5 ?v12 ?v7) (pred_2 ))
:effect (and (pred_11 ?v12)
   (not (pred_5 ?v12 ?v7)) (not (pred_2 ))))


(:action op_3
:parameters (?v7 ?v13 ?v9)
:precondition (and (pred_9 ?v7) (pred_12 ?v13) (pred_12 ?v9)
                  (pred_3 ?v7) (pred_11 ?v9) (pred_5 ?v13 ?v7))
:effect (and (pred_11 ?v13) (pred_5 ?v9 ?v7)
        (not (pred_11 ?v9)) (not (pred_5 ?v13 ?v7))))

(:action op_4
:parameters (?v7 ?v12)
:precondition (and (pred_9 ?v7) (pred_12 ?v12) 
                  (pred_3 ?v7) (pred_11 ?v12))
:effect (and (pred_2 ) (pred_5 ?v12 ?v7) (not (pred_11 ?v12)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_17 obj_05 obj_01 obj_08 obj_21 obj_20 obj_13 obj_10 obj_11 obj_03 obj_15 obj_14 obj_16 obj_06 obj_19 obj_07
    obj_02 obj_18
    obj_12 obj_09 obj_04
    )

    (:init
       (pred_2)

       (pred_9 obj_17)
       (pred_9 obj_05)
       (pred_9 obj_01)
       (pred_9 obj_08)
       (pred_9 obj_21)
       (pred_9 obj_20)
       (pred_9 obj_13)
       (pred_9 obj_10)
       (pred_9 obj_11)
       (pred_9 obj_03)
       (pred_9 obj_15)
       (pred_9 obj_14)
       (pred_9 obj_16)
       (pred_9 obj_06)
       (pred_9 obj_19)
       (pred_9 obj_07)
       (pred_8 obj_02)
       (pred_8 obj_18)
       (pred_12 obj_12)
       (pred_12 obj_09)
       (pred_12 obj_04)

       (pred_1 obj_17 obj_21)
       (pred_1 obj_17 obj_05)
       (pred_1 obj_05 obj_20)
       (pred_1 obj_05 obj_01)
       (pred_1 obj_05 obj_17)
       (pred_1 obj_01 obj_13)
       (pred_1 obj_01 obj_08)
       (pred_1 obj_01 obj_05)
       (pred_1 obj_08 obj_10)
       (pred_1 obj_08 obj_01)
       (pred_1 obj_21 obj_11)
       (pred_1 obj_21 obj_20)
       (pred_1 obj_21 obj_17)
       (pred_1 obj_20 obj_03)
       (pred_1 obj_20 obj_13)
       (pred_1 obj_20 obj_05)
       (pred_1 obj_20 obj_21)
       (pred_1 obj_13 obj_15)
       (pred_1 obj_13 obj_10)
       (pred_1 obj_13 obj_01)
       (pred_1 obj_13 obj_20)
       (pred_1 obj_10 obj_14)
       (pred_1 obj_10 obj_08)
       (pred_1 obj_10 obj_13)
       (pred_1 obj_11 obj_16)
       (pred_1 obj_11 obj_03)
       (pred_1 obj_11 obj_21)
       (pred_1 obj_03 obj_06)
       (pred_1 obj_03 obj_15)
       (pred_1 obj_03 obj_20)
       (pred_1 obj_03 obj_11)
       (pred_1 obj_15 obj_19)
       (pred_1 obj_15 obj_14)
       (pred_1 obj_15 obj_13)
       (pred_1 obj_15 obj_03)
       (pred_1 obj_14 obj_07)
       (pred_1 obj_14 obj_10)
       (pred_1 obj_14 obj_15)
       (pred_1 obj_16 obj_06)
       (pred_1 obj_16 obj_11)
       (pred_1 obj_06 obj_19)
       (pred_1 obj_06 obj_03)
       (pred_1 obj_06 obj_16)
       (pred_1 obj_19 obj_07)
       (pred_1 obj_19 obj_15)
       (pred_1 obj_19 obj_06)
       (pred_1 obj_07 obj_14)
       (pred_1 obj_07 obj_19)
       (pred_4 obj_21)
       (pred_4 obj_06)
       (pred_4 obj_14)
       (pred_7  obj_21 obj_02)
       (pred_7  obj_06 obj_18)
       (pred_7  obj_14 obj_18)
       (pred_6 obj_17)
       (pred_6 obj_05)
       (pred_6 obj_01)
       (pred_6 obj_08)
       (pred_6 obj_20)
       (pred_6 obj_13)
       (pred_6 obj_10)
       (pred_6 obj_11)
       (pred_6 obj_03)
       (pred_6 obj_15)
       (pred_6 obj_16)
       (pred_6 obj_19)
       (pred_6 obj_07)

       (pred_10  obj_12 obj_02)
       (pred_10  obj_09 obj_18)
       (pred_10  obj_04 obj_18)
       (pred_5 obj_12 obj_01)
       (pred_5 obj_09 obj_07)
       (pred_5 obj_04 obj_21)
       (pred_3 obj_10)
    )

    (:goal (and
       (pred_5 obj_12 obj_15)
    ))
(:constraints
  (always (not (pred_3 obj_13)))
)
)

; plan
1. (op_1 obj_10 obj_08)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_08)
   goals met: 0 of 1
2. (op_1 obj_08 obj_01)
   deleted: (pred_3 obj_08)
   added: (pred_3 obj_01)
   goals met: 0 of 1
3. (op_2 obj_01 obj_12)
   deleted: (pred_5 obj_12 obj_01) (pred_2)
   added: (pred_11 obj_12)
   goals met: 0 of 1
4. (op_1 obj_01 obj_05)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_05)
   goals met: 0 of 1
5. (op_1 obj_05 obj_20)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_20)
   goals met: 0 of 1
6. (op_1 obj_20 obj_03)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_03)
   goals met: 0 of 1
7. (op_1 obj_03 obj_15)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_15)
   goals met: 0 of 1
8. (op_4 obj_15 obj_12)
   deleted: (pred_11 obj_12)
   added: (pred_2) (pred_5 obj_12 obj_15)
   goals met: 1 of 1
